<template>
  <div>
    <h3>
      1. 创建该网站的缘由?
    </h3>
    <p>
      首先，网上不太容易找到全量的历史指数数据。
      其次，如果想根据历史指数数据做一些投放模拟，也没有相关工具。
      最后，网上能找到的定投计算器都是给定了收益率后，计算最终受益。
      实际上我需要的是做这样的计算，假设我在三年前每个礼拜买入100元，如今的收益率如何。
    </p>
    <h3>
      2. 如何使用?
    </h3>
    <p>
      在导航栏选择想要模拟计算定投的指数，进入相应页面后，输入你的定投日期、定投间隔、每期金额和<b>周期强制</b>，点击去计算后就可以看到相关数据了。
      <b>周期强制</b>指的是，如果理论投放的那一天如果是节假日。
      那么实际投放的日期应该在节后或节前，下一次的理论投放日期是：方案1、本次理论投放+周期间隔 方案2、本次实际投放+周期间隔。
      选中代表第一个方案，取消勾选代表第二个方案。
    </p>
    <h3>
      3. 数据准确吗?更新及时吗？
    </h3>
    <p>
      数据目前源自乐咕乐股网，每隔一段时间会更新一次。目前只有沪深300和上证50的数据，后期会补充上其他指数。
    </p>
    <h3>
      4. 如何联系我？
    </h3>
    <p>
      欢迎Star<a href="https://github.com/jiangmitiao/TermInvestmentFundCalculation" target="_blank">GitHub</a>
    </p>
  </div>
</template>

<script>
  export default {
    name: "Index",
    mounted() {
      // this.$router.push({
      //   path:"/HuShen300"
      // })
    }
  }
</script>

<style scoped>

</style>
